app/Controllers/DashboardController.php

    public function index()
    {
        $this->checkLogin();

        $productoModel = new ProductoModel();
        $ventaModel = new VentaModel();

        $data = [
            'title' => 'Inicio',
            'user_name' => session()->get('user_name'),
            'total_productos' => $productoModel->countAll(),
            'total_ventas' => $ventaModel->countAll(),
            'ventas_hoy' => $ventaModel->where('DATE(fecha_venta)', date('Y-m-d'))->countAllResults()
---
SELECT COUNT(*) AS `numrows` FROM `productos`
SELECT COUNT(*) AS `numrows` FROM `ventas`
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE DATE(fecha_venta) = '2026-01-08'