app/Controllers/LoginController.php

SELECT *
FROM `usuario`
WHERE `email` = 'admin@pos.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();