app/Controllers/ProductosController.php

    public function index()
    {
        $this->checkLogin();

        // Obtener parámetros de búsqueda
        $search = $this->request->getGet('search');
        $categoria_id = $this->request->getGet('categoria_id');

        // Construir consulta
        $builder = $this->productoModel->select('productos.*, categorias.nombre as categoria_nombre');
        $builder->join('categorias', 'categorias.id = productos.categoria_id', 'left');

        if (!empty($search)) {
            $builder->groupStart()
                    ->like('productos.nombre', $search)
                    ->orLike('productos.codigo', $search)
                    ->orLike('productos.descripcion', $search)
                    ->groupEnd();
        }

        if (!empty($categoria_id)) {
            $builder->where('productos.categoria_id', $categoria_id);
        }

        $productos = $builder->findAll();
        $categorias = $this->categoriaModel->findAll();
---
SELECT `productos`.*, `categorias`.`nombre` as `categoria_nombre`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
SELECT *
FROM `categorias`

    public function crear()
    {
        $this->checkLogin();

        $categorias = $this->categoriaModel->findAll();
---
SELECT *
FROM `categorias`


            ];

            $this->productoModel->insert($productoData);
---
INSERT INTO `productos` (`codigo`, `nombre`, `descripcion`, `precio`, `costo`, `stock`, `stock_minimo`, `categoria_id`, `imagen`) VALUES ('123145', 'coca-cola', '', '52.00', '45.00', '10', '5', '4', '1767897266_c19184cc215aa9f46c13.jpg')

    public function editar($id)
    {
        $this->checkLogin();

        $producto = $this->productoModel->find($id);
        $categorias = $this->categoriaModel->findAll();
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '12'
SELECT *
FROM `categorias`

    public function actualizar($id)
    {
        $this->checkLogin();

        $rules = [
            'nombre' => 'required',
            'precio' => 'required|decimal',
            'stock' => 'required|integer',
            'imagen' => 'max_size[imagen,2048]|is_image[imagen]' // Reglas para imagen
        ];

        // Verificar si el código es único (excluyendo el producto actual)
        $producto = $this->productoModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '12'

    public function eliminar($id)
    {
        $this->checkLogin();

        $producto = $this->productoModel->find($id);
        $detalleModel = new DetalleVentaModel();

        $detalleModel->where('producto_id', $id)->delete();

        if (!$producto) {
            return redirect()->to('admin/productos')->with('error', 'Producto no encontrado');
        }

        // Eliminar imagen si existe y no es la default
        if ($producto['imagen'] && $producto['imagen'] != 'default.png' && file_exists(ROOTPATH . 'public/uploads/productos/' . $producto['imagen'])) {
            unlink(ROOTPATH . 'public/uploads/productos/' . $producto['imagen']);
        }

        $this->productoModel->delete($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '12'
DELETE FROM `detalle_ventas`
WHERE `producto_id` = '12'
DELETE FROM `productos`
WHERE `id` IN ('12')