app/Controllers/VentasController.php

SELECT *
FROM `productos`
WHERE `activo` = 1
SELECT *
FROM `clientes`
---
    public function puntoVenta()
    {
        $this->checkLogin();


        $productos = $this->productoModel->where('activo', 1)->findAll();
        $clientes = $this->clienteModel->findAll();

INSERT INTO `ventas` (`folio`, `cliente_id`, `usuario_id`, `total`, `efectivo`, `cambio`, `estado`) VALUES ('V20251211144659874', NULL, 1, 15, 30, 15, 'completada')
---
                // 'fecha_venta' se auto-genera si tienes DEFAULT CURRENT_TIMESTAMP
            ];

            $venta_id = $this->ventaModel->insert($ventaData);

SELECT *
FROM `productos`
WHERE `productos`.`id` = 6
---

            // Procesar cada item del carrito
            foreach ($carrito as $item) {
                $producto = $this->productoModel->find($item['id']);

INSERT INTO `detalle_ventas` (`venta_id`, `producto_id`, `cantidad`, `precio_unitario`, `subtotal`) VALUES (10, 6, 1, 15, 15)
UPDATE `productos` SET `stock` = 5
WHERE `productos`.`id` IN (6)
---
                    'subtotal' => $item['subtotal']
                ];

                $this->detalleVentaModel->insert($detalleData);

                // Actualizar stock
                $nuevoStock = $producto['stock'] - $item['cantidad'];
                $this->productoModel->update($item['id'], ['stock' => $nuevoStock]);